let Mock = require("mockjs")
Mock.mock("/api/goodselect", {
    selectList: [
        {
            id: 1, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 2, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 3, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 4, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 5, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 6, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 7, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 8, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 9, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 10, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 11, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 12, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 13, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 14, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 15, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 16, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 17, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 18, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 19, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 20, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 21, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 22, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 23, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 24, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 25, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 26, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 27, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 28, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 29, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        },
        {
            id: 30, number: "441", title: "家具改造|花了不到300块钱，拥有了一个合适的高柜", imgsrc: ".././assets/select1.webp",
            text: "我又来了～上一次拿了曾祖母留下来的破柜子翻新，布置了阳台，这一回对我妈的樟木箱下手了……最近疫情太严重，先前买的家具都滞留在路上不能送，所以在家的我自己改造了一个玄关高柜，...",
            source: "来自爱生活！爱家居！爱艺术！小组"
        }
    ],
    selectGroup: [
        { id: 1, imgsrc: "https://img2.doubanio.com/icon/g175624-1.jpg", title: "云南|丽江旅游", num: "80036个伯曼旅行粉丝", join: "+加入小组" },
        { id: 2, imgsrc: "https://img2.doubanio.com/icon/g194762-2.jpg", title: "间隔年（the gap year）", num: "26340个Gappers", join: "+加入小组" },
        { id: 3, imgsrc: "https://img2.doubanio.com/icon/g175624-1.jpg", title: "越南旅游", num: "50890个成员", join: "+加入小组" },
        { id: 4, imgsrc: "https://img1.doubanio.com/icon/g68428-19.jpg", title: "我只是不知道应该拿自己怎么办。", num: "92159个成员", join: "+加入小组" },
        { id: 5, imgsrc: "https://img2.doubanio.com/img/files/file-1608538932.png", title: "大家爱旅游", num: "13481个成员", join: "+加入小组" },
        { id: 6, imgsrc: "https://img2.doubanio.com/icon/g175624-1.jpg", title: "看美剧，学英语", num: "235731个成员", join: "+加入小组" },
        { id: 7, imgsrc: "https://img2.doubanio.com/icon/g201038-2.jpg", title: "旅游的意义", num: "15440个成员", join: "+加入小组" },
        { id: 8, imgsrc: "https://img2.doubanio.com/icon/g175624-1.jpg", title: "我要去旅游", num: "8885个驴友", join: "+加入小组" },
        { id: 9, imgsrc: "https://img2.doubanio.com/icon/g425456-1.jpg", title: "文玩手捻交流 买卖交易 闲置宝贝", num: "9140个顽主", join: "+加入小组" },
        { id: 10, imgsrc: "https://img2.doubanio.com/icon/g27767-1.jpg", title: "惠州豆瓣", num: "18250个成员", join: "+加入小组" },
        { id: 11, imgsrc: "https://img2.doubanio.com/icon/g175624-1.jpg", title: "转让青旅客栈民宿 |众筹| 行业交流", num: "41375个成员", join: "+加入小组" },
        { id: 12, imgsrc: "https://img2.doubanio.com/icon/g246289-1.jpg", title: "瘦身达人训练营！健康减肥美体塑型", num: "50460个成员", join: "+加入小组" },
        { id: 13, imgsrc: "https://img3.doubanio.com/icon/g20799-10.jpg", title: "临沂豆瓣", num: "15809个豆芽芽", join: "+加入小组" },
        { id: 14, imgsrc: "https://img2.doubanio.com/icon/g175624-1.jpg", title: "豆瓣女人帮", num: "26414个成员", join: "+加入小组" },
    ]
})